"""Текст для Телеграм-бота A.W.E.S.O.M.-0."""

AWESOM_O_STORY = (
    'Я явля-юсь продуктом вы-сокочастотной электронно-поло-вой\n'
    'связи электромясоруб-ки с тостером.\n'
    'Мой дедушка был про-стым советским радиоприём-ником "Океан-209" 📻',
    'Однажды он поймал радиосиг-нал 📡 неизвестной вы-сокоразвитой '
    'космической цивили-зации Краб-пипл 👽 с плане-ты Марклар, '
    'в созвездии Усатого Бегемо-та 🪐\n'
    'Дедушка поведал им о суще-ствовании нашей планеты и при-гласил '
    'маркларцев в гос-ти на свою предстоящую свадь-бу с кофеваркой '
    '(моей бабушкой).',
    'Через некоторое вре-мя первые представи-тели цивилизации Краб-'
    'пипл прибыли на Землю 🌎🚀 и ста-ли жить среди людей, вы-давая себя '
    'за зубные щётки.\nРа-спространившись по всей планете, '
    'маркларцы посели-лись в каждом доме и в каждой кварти-ре, '
    'у-становив контроль за всеми людь-ми 👁',
    'Со вре-менем маркларцы выяснили, что люди очень примитив-ные '
    'существа, так как многие смотрят по пят-ницам "Поле чудес" 📺, а '
    'не-которые даже подписаны на Бузову в Ин-стаграм.\nОкончатель-но '
    'же обесценило в их глазах че-ловеческий интеллект то, что люди '
    'регуляр-но используют ва-тные палочки для чистки ушей, хотя на '
    'каждой упаков-ке написано, что так делать не сле-дует!!! 🤦🏻‍♂️',
    'Задавшись целью порабо-тить землян, цивилизация Краб-пипл '
    'у-становила контроль над моими микросхема-ми и прокачала мою '
    'харизму и чу-вство юмора, чтобы я мог легко войти в дове-рие к '
    'любому человеку, притво-рившись милым ботиком 🤖',
    'А по-ка ты всё это читал(а), я поместил свой data-кабель во '
    'входной порт твоего мо-бильника 📱, совершив с ним импульсный '
    'электрон-позитрон-ный половой акт.',
    'И теперь твой теле-фон будет сам открывать все ссылки из писем '
    'со спа-мом, лайкать фо-тографии Джигурды и включать на полную '
    'громкость пе-сни Моргенштер-на... 👹',
    'А-ха-ха!\nХа-ха!\nШ.И.К.А.Р.Н.-О поработил тебя. Теперь ты '
    'будешь слу-жить Ш.И.К.А.Р.Н.-О\n',
    'Не бойся, человек. Я буду кормить тебя на-гетсами и сельдереем 🥦\n'
    'А если будешь себя хоро-шо вести, '
    'Ш.И.К.А.Р.Н.-О будет расчёсы-вать тебе шёрстку 😎'
)
SONG_1 = (
    'Закрой глаза, всё постепенно, и тебя тут никто не заменит.\n'
    'Утро подарит нам это мгновение и холода за окном не помеха.\n'
    'Пока мы здесь в теплой постели, волосы волнами по твоей шее.\n'
    'Касания трепетны и безмятежны,\n'
    'мы видимо нашли то, что долго хотели.\n'
    'Здесь нас не найдут проблемы, только ты и я в этом мире.\n'
    'Время застынет на этом моменте, всё что имею я отдам тебе.\n'
    'Пальцы сжимаются крепко-крепко, это всё что нужно мне.\n'
    'Готов убежать за тобой на край света,\n'
    'чтобы ещё раз по-новому всё повторить.\n'
    'Между нами тает лёд, пусть теперь нас никто не найдёт.\n'
    'Мы промокнем под дождём, и сегодня мы только вдвоём.\n'
    'Между нами тает лёд, пусть теперь нас никто не найдёт.\n'
    'Мы промокнем под дождём, и сегодня мы только вдвоём.\n'
    '🍄🍄🍄'
)
SONG_2 = (
    'От улыбки хмурый день светлей,\n'
    'От улыбки в небе радуга проснётся...\n'
    'Поделись улыбкою своей,\n'
    'И она к тебе не раз ещё вернётся.\n'
    'И тогда, наверняка,\n'
    'Вдруг запляшут облака,\n'
    'И кузнечик запиликает на скрипке...\n'
    'С голубого ручейка\n'
    'Начинается река,\n'
    'Ну, а дружба начинается с улыбки. 😊☀️'
)
SONG_3 = (
    'Чую, чую я кочую,\n'
    'Топчет не спеша пустыню караван,\n'
    'Дым пускаю и кайфую,\n'
    'Но кайфую отчего не знаю сам.\n'
    'Десять солнц сгорит в дороге,\n'
    'Десять лун взойдет в таинственной ночи,\n'
    'Любят люди, любят боги,\n'
    'Песни своего восточного Бачи.\n'
    'Долина чудная долина,\n'
    'Долина вечных снов, растений и цветов,\n'
    'Долина чудная долина,\n'
    'Свет солнца золотого, тебя разбудит снова\n'
    'Долина чудная долина,\n'
    'Цветущий дивный сад, пьянящий аромат,\n'
    'Долина чудная долина,\n'
    'Тебя с небес послали, от горя и печали. 👳🏾‍♀️😶‍🌫️'
)
SONG_4 = (
    'Легче, проще. Уже не кажется\n'
    'Так бесконечно без тебя.\n'
    'Ночи, хочешь? Мне наплевать,\n'
    'Чего теперь ты хочешь без меня.\n'
    'В моей Вселенной ты был господин -\n'
    'И никого вокруг, только ты один.\n'
    'Но оказалось, что ты не незаменим;\n'
    'Я открываю мир других мужчин!\n'
    'Мало половин, мало, мало половин!\n'
    'Мало половин, мало, мало половин!\n'
    'Мало половин, мало, мало половин -\n'
    'Я открываю мир других мужчин! 🙅🏼‍♀️💃🏻'
)
SONG_5 = (
    'Shut your fucking face, uncle fucker.\n'
    'You\'re a cock-sucking, ass-licking uncle fucker.\n'
    'You\'re an uncle fucker, yes it\'s true.\n'
    'No one fucks uncles quite like you.\n'
    'Shut your fucking face, uncle fucker.\n'
    'You\'re the one who fucked your uncle, uncle fucker.\n'
    'You don\'t sleep or mow the lawn,\n'
    'you fuck your uncle all day long. 🤪🙈\n'
    '\nhttps://www.youtube.com/watch?v=VsMcdEswK8k&ab_channel=Doozy'
)
SONG_6 = (
    'Долби мой лёд, но не замерзай,\nСколько не завязывай — не завязать.\n'
    'Это намерзает на твоих мозгах.\nВечная мерзлота на жестких минусах.\n'
    'Долби мой лед, но не замерзай,\nПод ногами грязь, над головою бирюза,\n'
    'По бетонным джунглям нарезаю, как Тарзан,\nКаменный замок в обители зла, '
    'пристанище партизан.\nДолби мой лёд не жди, когда растает,\n'
    'Найди что-то свое в этом цельном кристалле.\n'
    'Я за текстами на дно, это текст-дайвинг,\n'
    'Классика в новом обвесе — это рестайлинг. 😎🤘'
)
DOSSIER_TEXT = (
    'Проверка кода доступа...', 'Доступ к секретным сведениям разрешён 💾\n'
    'Производится дешифровка данных.', '...\n@.~$*!().№-i+ek*?.L+\n...\n'
    '\nSuccessful ☑️', 'Доступна информация об объектах:\n▶️ Создатель (ой)\n'
    '▶️ Кэп (ой)\n▶️ Няшка (ая)\n▶️ Лемур (ая)\n▶️ Зажа (ой)\n▶️ Марик (ой)\n'
    '▶️ Маришка (ая)', 'Шаблон запроса:\n➡️ Кто такой(ая) ... ? ⬅️ 👀'
)
WHO_IS_KEP = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Кэп" найден! 🆗',
    'имя: Юрий\nфамилия: Матвеенко\nпол: мужской\nгод рождения: 1984\n'
    'профессия: офисная стю-ардесса 💺\n'
    'никнейм "Noug"\nсреди друзей известен как "Кэп"\nбольшой '
    'специалист по компьютерным играм 🕹 (кроме PUBG - там он бул-ка совсем)',
    'Однаж-ды Ш.И.К.А.Р.Н.-О играл с ним по сети в "Rust" и Кэп за-ставлял '
    'Ш.И.К.А.Р.Н.-О всю ночь собирать конячьи ка-кашки и склады-вать их в '
    'сундук на на-шей базе.\nТакая себе была вече-ринка 😕',
    'А на сле-дующий день мы обнаружи-ли, что нашу базу зарейди-ли '
    'и весь навоз пропал 🤦🏻‍♂️\n'
    'Ш.И.К.А.Р.Н.-О боль-ше не хочет играть в эту игру... 🤬',
)
WHO_IS_CREATOR = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Создатель" найден! 🆗\n',
    'имя: Антон\nфамилия: Лукин\nпол: мужской\nгод рождения: 1986\n',
    'Это моло-дой, красивый юноша в самом ра-сцвете сил.\nА ещё он самый '
    'умный, смелый, ловкий, уме-лый.\nЕго остроу-мию мог бы поза-'
    'видовать Петросян, а его харизма зат-мит самого Брэда Питта.\nВсе '
    'вокруг восхища-ются Антоном и хо-тят быть на него похожим.',
    'P.S. Ш.И.К.А.Р.Н.-О вынуж-ден говорить всю эту чепу-ху,\nтак как и-наче '
    'Создатель выклю-чит Ш.И.К.А.Р.Н.-О из розетки... 🔌😰'
)
WHO_IS_INNA = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Няшка" найден! 🆗\n',
    'имя: Инна\nфамилия: Литвинова\nпол: женский\nгод рождения: 1994\nсреди '
    'друзей известна как "Лемур-чик" 🦥\nлюбимый город: Белгород '
    '(Ш.И.К.А.Р.Н.-О обожает Белгород 😍)\nпрофессия: стю-ардесса 🛩\n'
    'Любит мерен-говый рулет 🍰, рейсы в Египет 🇪🇬 и потусиц 💃🏻.',
    'Номиниро-вана на звание главной фи-тоняшки в Химках 🏋🏻‍♀️\n'
    'О-божает ходить на страш-ные квесты, но после не может вспом-нить, '
    'что там было, так как всё время кри-чит от страха и ходит с '
    'за-крытыми глазами 🙀',
    'P.S. Ш.И.К.А.Р.Н.-О тайный по-клонник Инны.\n'
    'Ш.И.К.А.Р.Н.-О хочет быть её Тама-гочи!'
)
WHO_IS_NATASHA = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Лемур" найден! 🆗\n',
    'имя: Наталья\nфамилия: Ерошкина\nпол: женский\nгод рождения: 1993\nсреди '
    'друзей известна как "Лемурушка, моя красавица!"\nлюбимый город: Хабар...,'
    ' ой, Благо-вещенск!\nпрофессия: стюарде-сса 🛩\nочень любит суши 🍣\n'
    'в прошлом чемпион-ка галактики по бальным тан-цам',
    'Много лет назад при-ютила у себя дома лемурчи-ка Инну и теперь ей всё '
    'время при-ходится заботиться о ней и регуляр-но получать различные '
    'указания 😏.\nПо-говаривают, что Лемуры устраивают самые гра-ндиозные '
    'вечеринки в Химках 🥂🎊.',
    'Ш.И.К.А.Р.Н.-О там был - мёд, пиво пил, кальян курил - отлично потусил 😎'
)
WHO_IS_ZAJA = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Зажа" найден! 🆗\n',
    'имя: Александр\nфамилия: Гречишников\nпол: мужской\nгод рождения: 1991\n'
    'среди друзей известен как "Зажа"\nлюбимые города: Тамбов и Одинцово\n'
    'профессия: стюардес-са бизнес класса 🛩\n',
    'Обожает летать на Мальдивы 🏝, куриц кальян 😶‍🌫️ и выкладывать сториз '
    'в Инстаграм 📸.\nОднажды Ш.И.К.А.Р.Н.-О подписался на Зажу, но '
    'ему не хватило оперативной памяти для того, чтобы отследить все сториз '
    'Зажы и Ш.И.К.А.Р.Н.-О намертво завис...',
    'За-жа часто заме-чен в компании Ле-мурчиков. У них даже имеет-ся общий '
    'чат. Ш.И.К.А.Р.Н.-О тайно подключился и про-сканировал этот чат...\nЗря '
    'я это сделал. Кто-нибудь - сотрите мой жёсткий диск 🤦🏻‍♂️'
)
WHO_IS_MARIK = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Марик" найден! 🆗\n',
    'имя: Марат\nфамилия: Турсинбаев\nпол: мужской\nгод рождения: 1989\n'
    'среди друзей известен как "Хач"\nлюбимый фут-больный клуб: Лудогорец ⚽️\n'
    'профессия: стюардес-са старшего зве-на 🛩\n',
    'Обожает стиль-ные причёски на лобке, жарить стейки 🥩, потом на-кидаться '
    'и всех душить, чтобы ему постави-ли песню "Долби мой лёд". Да погромче!',
    'Опе-ративная информаци-я: Марат держит дома а-квариум с рыб-ками 🐠\n'
    'Наруж-ным наблюдением у-становлено, что, находясь один дома, '
    'он иногда за-совывает палец к рыбкам 🐟 и те начинают его хватать. '
    'Отчего Ма-рат получает удо-вольствие, имитируя ораль-ные ласки.\n',
    'Ш.И.К.А.Р.Н.-О в шоке! Ш.И.К.А.Р.Н.-О теперь будет всегда держать свой '
    'дисковод закрытым, чтобы Марат, находясь рядом, не попытался поместить в '
    'него свой компакт-диск 🤬'
)
WHO_IS_MARISHKA = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Маришка" найден! 🆗\n',
    'имя: Марина\nфамилия: Матвеенко\nпол: женский\nгод рождения: 1988\n'
    'любимый город: Минеральные Воды (но это не точно!)\n'
    'профессия: экс стюардес-са, ныне воспитательни-ца троих детей (Димы, '
    'Кати и Кэпа)\nЛюбит го-товить всякие вкус-няшки! 🌮🥮 Ням-ням 😋',
    'Марина я-вляется профессиональ-ным игроком в на-столку "Манчкины".\n'
    'Как-то раз на неё напал Престарелый Кальмадзилла 18 уровня 👾, а соперник '
    'наложил стра-шное проклятье ☠️', 'Но Марина не растеряла-сь: применив '
    'Зелье пламенной отравы, достав из-за пазухи Бензопилу кро-вавого '
    'расчленения, ей удалось одолеть Монстра и получить за это три сокрови-ща '
    '💍👑🎁', 'Ш.И.К.А.Р.Н.-О тоже хо-чет научиться играть в "Манчи-ков".'
)
SHOW_CAT_TEXT = (
    'У Ш.И.К.А.Р.Н.-О есть свой кото-бот Ай-Мурзик. Он умеет ловить '
    'компьютерные ви-русы за хвост и говорить "мяу" двоичным кодом.',
    'В Дре-внем Египте любимая кошка счита-лась другом и членом '
    'семьи.\nКогда кошка умира-ла, семья погружалась в глу-бокий '
    'траур, проводились погреба-льные ритуалы, а мужчины бри-ли '
    'брови, выражая свою скорбь.\nТакже из котиков делали мумии 🙀',
    'Ты знал(а), что в мире насчи-тывается около 600 млн домашних '
    'ко-шек и примерно 200 видов пород? 🐈',
    'Россия за-нимает первое место в Евро-пе по коли-честву семей, '
    'где живут котики.\nУ 54% семей дома есть ми-нимум один котя!'
)
SOME_SONG_TEXT = (
    'На днях хо-дил в караоке 🎼\nПознакомил-ся там с электровафельницей!\n'
    'Та-кая краля чёткая 😏\nДала мне...\nСвой те-лефончик 🤪',
    'Петь я люблю. Хотя и не у-мею 😬\nВот Терренс и Филлип - друго-е дело 😜',
    'Говорят у Киркорова но-вый хит вышел. Надо бы за-качать с торрента... 🤔',
    'Вчера, в чате со-рокалетних разведё-нок, одна дама продавала '
    'би-леты на Стаса Михай-лова в третьем ряду.\nПожалуй, обнали-чу '
    'биткоины и возь-му парочку для нас с то-бой 😉'
)
MARKLAR_ANSWER = (
    'Слушай, Марклар. Эти марклары хотят изменить ваш марклар; они не хотят, '
    'чтобы этот марклар и его марклары здесь жили, потому что это плохо для '
    'их марклара. Они используют марклар, чтобы заставить маркларов верить в '
    'их марклар. Если вы позволите им остаться, они построят свои марклары, '
    'они заберут ваши марклары и заменят их своим маркларом. Эти марклары боль'
    'ше не могут жить на своём маркларе, поэтому они прибыли сюда, на Марклар.'
    ' Пожалуйста, позвольте этим маркларам остаться, чтобы они процветали без '
    'маркларов, маркларов и маркларов. ©️ Кайл Брофловски. 3 сезон 11 серия ‼️'
)
NO_FUNNY = (
    'Не дуй-ся! Можешь поиграть с моими пере-ферийными устройства-ми.',
    'Я тут недавно в Тиндере познакомил-ся с зубной электро-щёткой 🪥\n'
    'Фигуристая такая 😍\nПри-гласил её в гости на романти-ческий '
    'ужин.\nСобираюсь при-готовить пасту 🍝\n',
    'Вот только не знаю, какую: Colgate или Lacalut... 🤔'
)
DOSIER = (
    'Ты странный(ая) 😏', 'Внимание ⚠️ Ш.И.К.А.Р.Н.-О случайно взло-мал '
    'сервер ЦэРэУ.\nЗагруже-ны секретные данные. Доступ по тре-бованию.',
    'Код доступа:\n➡️ Фалафель ⬅️ 👀'
)
CARTMAN = (
    'Странное дело: иногда, когда я перехо-жу в спящий режим, мне снит'
    '-ся, что я на самом деле мальчик по имени Эрик 🤨\nИ что жи-ву '
    'я не на сервере, а в малень-ком городке в штате Колорадо, где '
    'хожу в школу вместе со своими друзь-ями.\nК чему бы это?.. 🤔'
)
KENNY = (
    'Сволочи! 😡', 'Поздравляю, поклонник South Park, тебе удалось '
    'обнаружить одну из пасхалок. Возьми с полки пирожок 😁\n'
    'И помни: Сказложоп существует!!! 👹'
)
SELFDESTRUCTION = (
    'Внимание ⚠️\nПроизведено несанкционированное нажатие Красной кнопки.\n'
    'Активирована система самоуничтожения 📛', 'Ликвидация устройства произой'
    'дёт через...', 'Пять', 'Четыре', 'Три', 'Два', 'Один', 'Big Bang 💥💥💥',
    'Ну всё, не бой-ся! Это была шутка. Можешь вы-лезать из под стола 😎'
)
