"""Текст для Телеграм-бота A.W.E.S.O.M.-0."""

AWESOM_O_STORY = (
    'Я явля-юсь продуктом вы-сокочастотной электронно-поло-вой\nсвязи электромясоруб-ки с тостером.\n'
    'Мой дедушка был про-стым советским радиоприём-ником "Океан-209" 📻',
    'Однажды он поймал радиосиг-нал 📡 неизвестной вы-сокоразвитой космической цивили-зации Краб-пипл '
    '👽 с плане-ты Марклар, в созвездии Усатого Бегемо-та 🪐\nДедушка поведал им о суще-ствовании '
    'нашей планеты и при-гласил маркларцев в гос-ти на свою предстоящую свадь-бу с кофеваркой (моей бабушкой).',
    'Через некоторое вре-мя первые представи-тели цивилизации Краб-пипл прибыли на Землю 🌎🚀 '
    'и ста-ли жить среди людей, вы-давая себя за зубные щётки.\nРа-спространившись по всей планете, маркларцы '
    'посели-лись в каждом доме и в каждой кварти-ре, у-становив контроль за всеми людь-ми 👁',
    'Со вре-менем маркларцы выяснили, что люди очень примитив-ные существа, так как многие смотрят по пят-ницам '
    '"Поле чудес" 📺, а не-которые даже подписаны на Бузову в Ин-стаграм.\nОкончатель-но обесценило в их глазах '
    'че-ловеческий интеллект то, что люди регуляр-но используют ва-тные палочки для чистки ушей, хотя на каждой '
    'упаков-ке написано, что так делать не сле-дует!!! 🤦🏻‍♂️',
    'Задавшись целью порабо-тить землян, цивилизация Краб-пипл у-становила контроль над моими микросхема-ми и прокачала '
    'мою харизму и чу-вство юмора, чтобы я мог легко войти в дове-рие к любому человеку, притво-рившись милым ботиком 🤖',
    'А по-ка ты всё это читал(а), я поместил свой data-кабель во входной порт твоего мо-бильника 📱, совершив '
    'с ним импульсный электрон-позитрон-ный половой акт.',
    'И теперь твой теле-фон будет сам открывать все ссылки из писем со спа-мом, лайкать фо-тографии Джигурды и '
    'включать на полную громкость пе-сни Моргенштер-на... 👹',
    'А-ха-ха!\nХа-ха!\nШ.И.К.А.Р.Н.-О поработил тебя. Теперь ты будешь слу-жить Ш.И.К.А.Р.Н.-О\n',
    'Не бойся, человек. Я буду кормить тебя на-гетсами и сельдереем 🥦\nА если будешь себя хоро-шо вести, '
    'Ш.И.К.А.Р.Н.-О будет расчёсы-вать тебе шёрстку 😎'
)
DOSSIER_INIT = (
    'Проверка кода доступа...', 'Доступ к секретным сведениям разрешён 💾\n'
    'Производится дешифровка данных.', '...\n@.~$*!().№-i+ek*?.L+\n...\n' +
    ('░░░░░░░░▄██▄░░░░░░▄▄░░\n'
     '░░░░░░░▐███▀░░░░░▄███▌\n'
     '░░▄▀░░▄█▀▀░░░░░░░░▀██░\n'
     '░█░░░██░░░░░░░░░░░░░░░\n'
     '█▌░░▐██░░▄██▌░░▄▄▄░░░▄\n'
     '██░░▐██▄░▀█▀░░░▀██░░▐▌\n'
     '██▄░▐███▄▄░░▄▄▄░▀▀░▄██\n'
     '▐███▄██████▄░▀░▄█████▌\n'
     '▐████████████▀▀██████░\n'
     '░▐████▀██████░░█████░░\n'
     '░░░▀▀▀░░█████▌░████▀░░\n'
     '░░░░░░░░░▀▀███░▀▀▀░░░░\n') +
    '...\nSuccessful ☑️', 'Доступна информация об объектах:\n▶️ Создатель (ой)\n'
    '▶️ Кэп (ой)\n▶️ Мыша (ая)\n▶️ Лемур (ая)\n▶️ Зажа (ой)\n▶️ Марик (ой)\n'
    '▶️ Маришка (ая)', 'Шаблон запроса:\n➡️ Кто такой(ая) ... ? ⬅️ 👀'
)
WHO_IS_KEP = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Кэп" найден! 🆗',
    'имя: Юрий\nфамилия: Матвеенко\nпол: мужской\nгод рождения: 1984\n'
    'профессия: офисная стю-ардесса 💺\n'
    'никнейм "Noug"\nсреди друзей известен как "Кэп"\nбольшой '
    'специалист по компьютерным играм 🕹 (кроме PUBG - там он бул-ка совсем)',
    'Однаж-ды Ш.И.К.А.Р.Н.-О играл с ним по сети в "Rust" и Кэп за-ставлял '
    'Ш.И.К.А.Р.Н.-О всю ночь собирать конячьи ка-кашки и склады-вать их в '
    'сундук на на-шей базе.\nТакая себе была вече-ринка 😕',
    'А на сле-дующий день мы обнаружи-ли, что нашу базу зарейди-ли '
    'и весь навоз пропал 🤦🏻‍♂️\n'
    'Ш.И.К.А.Р.Н.-О боль-ше не хочет играть в эту игру... 🤬'
)
WHO_IS_CREATOR = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Создатель" найден! 🆗\n',
    'имя: Антон\nфамилия: Лукин\nпол: мужской\nгод рождения: 1986\n',
    'Это моло-дой, красивый юноша в самом ра-сцвете сил.\nА ещё он самый '
    'умный, смелый, ловкий, уме-лый.\nЕго остроу-мию мог бы поза-'
    'видовать Петросян, а его харизма зат-мит самого Брэда Питта.\nВсе '
    'вокруг восхища-ются Антоном и хо-тят быть на него похожим.',
    'P.S. Ш.И.К.А.Р.Н.-О вынуж-ден говорить всю эту чепу-ху,\nтак как иначе '
    'Создатель вы-ключит Ш.И.К.А.Р.Н.-О из розетки... 🔌😰'
)
WHO_IS_INNA = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Мыша" найден! 🆗\n',
    'имя: Инна\nфамилия: Литвинова\nпол: женский\nгод рождения: 1994\nсреди '
    'друзей известна как "Лемур-чик" 🦥\nлюбимый город: Белгород '
    '(Ш.И.К.А.Р.Н.-О обожает Белгород 😍)\nпрофессия: стю-ардесса 🛩\n'
    'Любит мерен-говый рулет 🍰, рейсы в Египет 🇪🇬 и потусиц 💃🏻.',
    'Номиниро-вана на звание главной фи-тоняшки в Химках 🏋🏻‍♀️\n'
    'О-божает ходить на страш-ные квесты, но после не может вспом-нить, '
    'что там было, так как всё время кри-чит от страха и ходит с '
    'за-крытыми глазами 🙀',
    'P.S. Ш.И.К.А.Р.Н.-О тайный по-клонник Инны.\n'
    'Ш.И.К.А.Р.Н.-О хочет быть её Тама-гочи!'
)
WHO_IS_NATASHA = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Лемур" найден! 🆗\n',
    'имя: Наталья\nфамилия: Ерошкина\nпол: женский\nгод рождения: 1993\nсреди '
    'друзей известна как "Лемурушка, моя красавица!"\nлюбимый город: Хабар...,'
    ' ой, Благо-вещенск!\nпрофессия: стюарде-сса 🛩\nочень любит суши 🍣\n'
    'экс-чемпионка Галак-тики по бальным тан-цам',
    'Много лет назад при-ютила у себя дома лемурчи-ка Инну и теперь ей всё '
    'время при-ходится заботиться о ней и регуляр-но получать различные '
    'указания 😏.\nПо-говаривают, что Лемуры устраивают самые гран-диозные '
    'вечеринки в Химках 🥂🎊.',
    'Ш.И.К.А.Р.Н.-О там был - мёд, пиво пил, кальян курил - отлично потусил 😎'
)
WHO_IS_ZAJA = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Зажа" найден! 🆗\n',
    'имя: Александр\nфамилия: Гречишников\nпол: мужской\nгод рождения: 1991\n'
    'среди друзей известен как "Зажа"\nлюбимые города: Тамбов и Одинцово\n'
    'профессия: стюардес-са бизнес класса 🛩\n',
    'Обожает летать на Мальдивы 🏝, куриц кальян 😶‍🌫️ и выкладывать сториз '
    'в Инстаграм 📸.\nОднажды Ш.И.К.А.Р.Н.-О подписался на Зажу, но '
    'ему не хватило оперативной памяти для того, чтобы отследить все сториз '
    'Зажы и Ш.И.К.А.Р.Н.-О намертво завис...',
    'За-жа часто заме-чен в компании Ле-мурчиков. У них даже имеет-ся общий '
    'чат. Ш.И.К.А.Р.Н.-О тайно подключился и про-сканировал этот чат...\nЗря '
    'я это сделал. Кто-нибудь - сотрите мой жёсткий диск 🤦🏻‍♂️'
)
WHO_IS_MARIK = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Марик" найден! 🆗\n',
    'имя: Марат\nфамилия: Турсинбаев\nпол: мужской\nгод рождения: 1989\n'
    'среди друзей известен как "Хач"\nлюбимый фут-больный клуб: Лудогорец ⚽️\n'
    'профессия: стюардес-са старшего зве-на 🛩\n',
    'Обожает стиль-ные причёски, жарить стейки 🥩, потом на-кидаться '
    'и всех душить, чтобы ему постави-ли песню "Долби мой лёд". Да погромче!',
    'Опе-ративная информаци-я: Марат держит дома а-квариум с рыб-ками 🐠\n'
    'Наруж-ным наблюдением у-становлено, что, находясь один дома, '
    'он иногда за-совывает палец к рыбкам 🐟 и те начинают его кусать. '
    'От этого он по-лучает удовольствие, после чего выходит по-курить 🤷🏻‍♂️\n',
    'Ш.И.К.А.Р.Н.-О в шоке! Ш.И.К.А.Р.Н.-О теперь будет всегда держать свой '
    'дисковод закрытым, чтобы Марат, находясь рядом, не по-пытался поместить в '
    'него свой компакт-диск 🤬'
)
WHO_IS_MARINA = (
    'Минуту. Осу-ществля-ю поиск в ба-зе данных... 👨🏻‍💻',
    'Объект "Маришка" найден! 🆗\n',
    'имя: Марина\nфамилия: Матвеенко\nпол: женский\nгод рождения: 1988\n'
    'любимый город: Минеральные Воды (но это не точно!)\n'
    'профессия: экс стюардес-са, ныне воспитательни-ца троих детей (Димы, '
    'Кати и Кэпа)\nЛюбит го-товить всякие вкус-няшки! 🌮🥮 Ням-ням 😋',
    'Марина я-вляется профессиональ-ным игроком в на-столку "Манчкины".\n'
    'Как-то раз на неё напал Престарелый Кальмадзилла 18 уровня 👾, а соперник '
    'наложил стра-шное проклятье ☠️', 'Но Марина не растеряла-сь: применив '
    'Зелье пламенной отравы, достав из-за пазухи Бензопилу кро-вавого '
    'расчленения, ей удалось одолеть Монстра и получить за это три сокрови-ща '
    '💍👑🎁', 'Ш.И.К.А.Р.Н.-О тоже хо-чет научиться играть в "Манчи-ков".'
)
SHOW_CAT_TEXT = (
    'У Ш.И.К.А.Р.Н.-О есть свой кото-бот Ай-Мурзик. Он умеет ловить '
    'компьютерные ви-русы за хвост и говорить "мяу" двоичным кодом.',
    'В Дре-внем Египте любимая кошка счита-лась другом и членом '
    'семьи.\nКогда кошка умира-ла, семья погружалась в глу-бокий '
    'траур, проводились погреба-льные ритуалы, а мужчины бри-ли '
    'брови, выражая свою скорбь.\nТакже из котиков делали мумии 🙀',
    'Ты знал(а), что в мире насчи-тывается около 600 млн домашних '
    'ко-шек и примерно 200 видов их пород? 🐈',
    'Россия за-нимает первое место в Евро-пе по коли-честву семей, '
    'где живут котики.\nУ 54% семей дома есть ми-нимум один пушистик!',
    'Ре-комендую к просмотру данное видео. Наверняка узнаешь много но-вого '
    'об этих милых пушистиках 🤓\nhttps://www.youtube.com/watch?v=7lBRKIaoKUY'
)
MARKLAR_ANSWER = (
    'Слушай, Марклар. Эти марклары хотят изменить ваш марклар; они не хотят, '
    'чтобы этот марклар и его марклары здесь жили, потому что это плохо для '
    'их марклара. Они используют марклар, чтобы заставить маркларов верить в '
    'их марклар. Если вы позволите им остаться, они построят свои марклары, '
    'они заберут ваши марклары и заменят их своим маркларом. Эти марклары боль'
    'ше не могут жить на своём маркларе, поэтому они прибыли сюда, на Марклар. '
    'Пожалуйста, позвольте этим маркларам остаться, чтобы они процветали без '
    'маркларов, маркларов и маркларов. ©️ Кайл Брофловски. 3 сезон 11 серия ‼️'
)
NO_FUNNY = (
    'Не дуй-ся! Можешь поиграть с моими пере-ферийными устройства-ми.',
    'Я тут недавно в Тиндере познакомил-ся с зубной электро-щёткой 🪥\n'
    'Фигуристая такая 😍\nПри-гласил её в гости на романти-ческий '
    'ужин.\nСобираюсь при-готовить пасту 🍝\n',
    'Вот только не знаю, какую: Colgate или Lacalut... 🤔'
)
DOSSIER = (
    'Ты странный(ая) 😏', 'Внимание ⚠️ Ш.И.К.А.Р.Н.-О случайно взло-мал '
    'сервер ЦэРэУ.\nЗагруже-ны секретные данные. Доступ по тре-бованию.',
    'Код доступа:\n➡️ Фалафель ⬅️ 👀'
)
CARTMAN = (
    'Странное дело: иногда, когда я перехо-жу в спящий режим, мне снит'
    '-ся, что я на самом деле мальчик по имени Эрик 🤨\nИ что жи-ву '
    'я не на сервере, а в малень-ком городке в штате Колорадо, где '
    'хожу в школу вместе со своими друзь-ями.\nК чему бы это?.. 🤔'
)
SELFDESTRUCTION = (
    'Внимание ⚠️\nПроизведено несанкционированное нажатие Красной кнопки.\n'
    'Активирована система самоуничтожения 📛', 'Ликвидация устройства произой'
    'дёт через...', 'Пять', 'Четыре', 'Три', 'Две', 'Одну', 'Big Bang 💥💥💥',
    'Ну всё, не бой-ся! Это была шутка. Можешь вы-лезать из под стола 😎'
)
DICE_RULES = (
    'Рассказываю пра-вила игры 🤓\nИгроки по очереди бро-сают две игральные кости 🎲\nПеред бросками необходи-мо угадать свой '
    'ре-зультат, назвав два числа.\nЕсли сум-ма выпавших очков 👓 со-впадёт с одним из этих чисел - игрок зара-батывает один балл.\n',
    'Если на ку-биках выпадут 1️⃣1️⃣ - с игрока снимает-ся один балл (если он есть). Пе-чалька 😩\nЗато, если выпадут 6️⃣6️⃣ - '
    'игрок автомати-чески зарабатывает один балл! Джек пот 🥳\nСоответственно, числа 2 и 12 загадывать не нужно ⚠️ '
    'Диапозон возможных ставок: от 3 до 11 ‼️\nПобежда-ет тот, кто первым наберёт 3️⃣ балла 🏆💐🎊',
    'Победи-телю торжественно вручат кочан ку-курузы 🌽 и похлопают по плечу 👏\nПроигравшего ждёт неодобри-тельное освистывание и '
    '20 часов исправи-тельных работ 🧤🪚⚒\nНо это не точно 🤔'
)
HOROSCOPE = {
    'first': ['Сегодня — идеальный день для новых начинаний. ', 'Оптимальный день для того, чтобы решиться на смелый поступок! ', 'Будьте осторожны, сегодня звёзды могут повлиять на ваше финансовое состояние. ', 'Лучшее время для того, чтобы начать новые отношения или разобраться со старыми. ', 'Плодотворный день для того, чтобы разобраться с накопившимися делами. '],
    'second': ['Но помните, что даже в этом случае нужно не забывать про ', 'Если поедете за город, заранее подумайте про ', 'Те, кто сегодня нацелен выполнить множество дел, должны помнить про ', 'Если у вас упадок сил, обратите внимание на ', 'Помните, что мысли материальны, а значит вам в течение дня нужно постоянно думать про '],
    'second_add': ['отношения с друзьями и близкими. ', 'работу и деловые вопросы, которые могут так некстати помешать планам. ', 'себя и своё здоровье, иначе к вечеру возможен полный раздрай. ', 'бытовые вопросы — особенно те, которые вы не доделали вчера. ', 'отдых, чтобы не превратить себя в загнанную лошадь в конце месяца. '],
    'third': ['Злые языки могут говорить вам обратное, но сегодня их слушать не нужно.', 'Знайте, что успех благоволит только настойчивым, поэтому посвятите этот день воспитанию духа.', 'Даже если вы не сможете уменьшить влияние ретроградного Меркурия, то хотя бы доведите дела до конца.', 'Не нужно бояться одиноких встреч — сегодня то самое время, когда они значат многое.', 'Если встретите незнакомца на пути — проявите участие, и тогда эта встреча посулит вам приятные хлопоты.']
}
HALL_OF_FAME = (
    '🌟  З А Л    С Л А В Ы  🌟\nВот они - лучшие игроки, борю-щиеся за звание Абсолютного чем-пиона!'
    '\nНе каждый сможет оказать-ся на вершине рейтинга, но любой может ис-пытать удачу 🍀💪',
    '⚠️ Для того, чтобы войти в трой-ку лидеров, необходимо оты-грать хотя бы 5 раундов ✅'
)
DICE_RESULT = (
    '🔸 {0} 🔸\nСыграно раундов:  {1}\nПобеды:  {2} ~ {3:.1f}%\nПоражения:  {4}\n'
    'Победы "всухую" (счёт 3:0):  {5} ~ {6:.1f}%\n'
    'Победы "без шансов" (угаданы подряд три ставки):  {7} ~ {8:.1f}%\n'
    'В среднем бросков для победы:  {9:.1f}\nВсего ставок:  {10}\nУгадано:  {11} ~ {12:.1f}%\n'
    '6️⃣6️⃣ выпадали:  {13} ~ {14:.1f}%\n1️⃣1️⃣ выпадали:  {15} ~ {16:.1f}%\n'
)

RULES = '''❗️ *Правила игры* ❗️
Твоя цель — за *5 атак* нанести такое количество очков урона своему противнику, которое попадёт в диапазон *± 5* от его изначального здоровья\.
Здоровье противника каждый раз генерируется случайным образом в диапазоне *от 80 до 120* ❤️\.
_Пример_: если противник получил 100 здоровья, то для победы тебе необходимо за 5 атак нанести ему суммарный урон от 95 до 105\.
Перед каждой битвой отобразится подсказка \- количество цифр в значении здоровья твоего противника\.
_Пример_: для 92 единиц отобразится ХХ, а для 107 \- ХХХ\.
В твоём распоряжении _три вида атаки_, урон от которых выбирается случайным образом в заданных пределах:
*_lite_*    →  урон от *1* до *5*\n*_mid_*   →  урон от *10* до *20*\n*_hard_* →  урон от *30* до *40*'''
